       *> { dg-do run }
       *> { dg-output-file "group2/Simple_floating-point_VALUE_and_MOVE.out" }

        IDENTIFICATION DIVISION.
        PROGRAM-ID. float-demo.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 P-1 PIC 999PPPPPP COMP-5 VALUE 123000000.
        01 C-1A COMP-1 VALUE  12.3456E-7.
        01 C-1B COMP-1 VALUE  12.3456E-6.
        01 C-1C COMP-1 VALUE  12.3456E-5.
        01 C-1D COMP-1 VALUE  12.3456E-4.
        01 C-1E COMP-1 VALUE  12.3456E-3.
        01 C-1F COMP-1 VALUE  12.3456E-2.
        01 C-1G COMP-1 VALUE  12.3456E-1.
        01 C-1H COMP-1 VALUE  12.3456E0 .
        01 C-1I COMP-1 VALUE  12.3456E1 .
        01 C-1J COMP-1 VALUE  12.3456E2 .
        01 C-1K COMP-1 VALUE  12.3456E3 .
        01 C-1L COMP-1 VALUE  12.3456E4 .
        01 C-1M COMP-1 VALUE  12.3456E5 .
        01 C-1N COMP-1 VALUE  12.3456E6 .
        01 C-1O COMP-1 VALUE  12.3456E7 .
        01 C-1P COMP-1 VALUE  12.3456E8 .
        01 C-1Q COMP-1 VALUE  12.3456E9 .
        01 C-1R COMP-1 VALUE  12.3456E10.
        01 C-1S COMP-1 VALUE  12.3456E11.
        01 C-2A COMP-2 VALUE  12.3456789098765E-7.
        01 C-2B COMP-2 VALUE  12.3456789098765E-6.
        01 C-2C COMP-2 VALUE  12.3456789098765E-5.
        01 C-2D COMP-2 VALUE  12.3456789098765E-4.
        01 C-2E COMP-2 VALUE  12.3456789098765E-3.
        01 C-2F COMP-2 VALUE  12.3456789098765E-2.
        01 C-2G COMP-2 VALUE  12.3456789098765E-1.
        01 C-2H COMP-2 VALUE  12.3456789098765E0 .
        01 C-2I COMP-2 VALUE  12.3456789098765E1 .
        01 C-2J COMP-2 VALUE  12.3456789098765E2 .
        01 C-2K COMP-2 VALUE  12.3456789098765E3 .
        01 C-2L COMP-2 VALUE  12.3456789098765E4 .
        01 C-2M COMP-2 VALUE  12.3456789098765E5 .
        01 C-2N COMP-2 VALUE  12.3456789098765E6 .
        01 C-2O COMP-2 VALUE  12.3456789098765E7 .
        01 C-2P COMP-2 VALUE  12.3456789098765E8 .
        01 C-2Q COMP-2 VALUE  12.3456789098765E9 .
        01 C-2R COMP-2 VALUE  12.3456789098765E10.
        01 C-2S COMP-2 VALUE  12.3456789098765E11.
        01 C-2T COMP-2 VALUE  12.3456789098765E12.
        01 C-2U COMP-2 VALUE  12.3456789098765E13.
        01 C-2V COMP-2 VALUE  12.3456789098765E14.
        01 C-2W COMP-2 VALUE  12.3456789098765E15.
        01 C-2X COMP-2 VALUE  12.3456789098765E16.
        01 C-EA FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-7.
        01 C-EB FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-6.
        01 C-EC FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-5.
        01 C-ED FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-4.
        01 C-EE FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-3.
        01 C-EF FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-2.
        01 C-EG FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E-1.
        01 C-EH FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E0 .
        01 C-EI FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E1 .
        01 C-EJ FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E2 .
        01 C-EK FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E3 .
        01 C-EL FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E4 .
        01 C-EM FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E5 .
        01 C-EN FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E6 .
        01 C-EO FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E7 .
        01 C-EP FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E8 .
        01 C-EQ FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E9 .
        01 C-ER FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E10.
        01 C-ES FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E11.
        01 C-ET FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E12.
        01 C-EU FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E13.
        01 C-EV FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E14.
        01 C-EW FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E15.
        01 C-EX FLOAT-EXTENDED VALUE  11.11222233334444995555666677778888E16.
        01 A PIC X(24).
        PROCEDURE DIVISION.
        DISPLAY "Variations on COMP-1 12."
        MOVE 12.E-7 TO C-1A .
        MOVE 12.E-6 TO C-1B .
        MOVE 12.E-5 TO C-1C .
        MOVE 12.E-4 TO C-1D .
        MOVE 12.E-3 TO C-1E .
        MOVE 12.E-2 TO C-1F .
        MOVE 12.E-1 TO C-1G .
        MOVE 12.E0  TO C-1H .
        MOVE 12.E1  TO C-1I .
        MOVE 12.E2  TO C-1J .
        MOVE 12.E3  TO C-1K .
        MOVE 12.E4  TO C-1L .
        MOVE 12.E5  TO C-1M .
        MOVE 12.E6  TO C-1N .
        MOVE 12.E7  TO C-1O .
        MOVE 12.E8  TO C-1P .
        MOVE 12.E9  TO C-1Q .
        MOVE 12.E10 TO C-1R .
        MOVE 12.E11 TO C-1S .
        PERFORM DISPLAY-COMP-1.
        DISPLAY "Variations on COMP-2 12.3456789098765"
        PERFORM DISPLAY-COMP-2.
        DISPLAY "Variations on COMP-2 12."
        MOVE 12.E-7 TO C-2A .
        MOVE 12.E-6 TO C-2B .
        MOVE 12.E-5 TO C-2C .
        MOVE 12.E-4 TO C-2D .
        MOVE 12.E-3 TO C-2E .
        MOVE 12.E-2 TO C-2F .
        MOVE 12.E-1 TO C-2G .
        MOVE 12.E0  TO C-2H .
        MOVE 12.E1  TO C-2I .
        MOVE 12.E2  TO C-2J .
        MOVE 12.E3  TO C-2K .
        MOVE 12.E4  TO C-2L .
        MOVE 12.E5  TO C-2M .
        MOVE 12.E6  TO C-2N .
        MOVE 12.E7  TO C-2O .
        MOVE 12.E8  TO C-2P .
        MOVE 12.E9  TO C-2Q .
        MOVE 12.E10 TO C-2R .
        MOVE 12.E11 TO C-2S .
        MOVE 12.E12 TO C-2T .
        MOVE 12.E13 TO C-2U .
        MOVE 12.E14 TO C-2V .
        MOVE 12.E15 TO C-2W .
        MOVE 12.E16 TO C-2X .
        PERFORM DISPLAY-COMP-2.
        DISPLAY "Variations on FLOAT-EXTENDED 11.11222233334444995555666677778888"
        PERFORM DISPLAY-EXTENDED.
        GOBACK.
        DISPLAY-COMP-1.
            DISPLAY C-1A
            DISPLAY C-1B
            DISPLAY C-1C
            DISPLAY C-1D
            DISPLAY C-1E
            DISPLAY C-1F
            DISPLAY C-1G
            DISPLAY C-1H
            DISPLAY C-1I
            DISPLAY C-1J
            DISPLAY C-1K
            DISPLAY C-1L
            DISPLAY C-1M
            DISPLAY C-1N.
        DISPLAY-COMP-2.
            DISPLAY C-2A
            DISPLAY C-2B
            DISPLAY C-2C
            DISPLAY C-2D
            DISPLAY C-2E
            DISPLAY C-2F
            DISPLAY C-2G
            DISPLAY C-2H
            DISPLAY C-2I
            DISPLAY C-2J
            DISPLAY C-2K
            DISPLAY C-2L
            DISPLAY C-2M
            DISPLAY C-2N.
        DISPLAY-EXTENDED.
            DISPLAY C-EA
            DISPLAY C-EB
            DISPLAY C-EC
            DISPLAY C-ED
            DISPLAY C-EE
            DISPLAY C-EF
            DISPLAY C-EG
            DISPLAY C-EH
            DISPLAY C-EI
            DISPLAY C-EJ
            DISPLAY C-EK
            DISPLAY C-EL
            DISPLAY C-EM
            DISPLAY C-EN.
        END PROGRAM float-demo.

